Prototype/frontend/views/site/signup.php

SELECT * FROM `region`
SELECT * FROM `province`
SELECT * FROM `city_municipal`
SELECT * FROM `barangay`
---
                    </div>

                    <div class="col-md-3">
                        <?= $form->field($model, 'region')->dropDownList(
                            ArrayHelper::map(Region::find()->all(), 'name', 'name'),
                            [
                                'prompt' => 'Select Region',

                            ]);?>
                    </div>

                    <div class="col-md-3">
                        <?= $form->field($model, 'province')->dropDownList(
                            ArrayHelper::map(Province::find()->all(), 'name', 'name'),
                            [
                                'prompt' => 'Select Province',

                            ]);?>
                    </div>

                    <div class="col-md-3">
                        <?= $form->field($model, 'city_municipal')->dropDownList(
                            ArrayHelper::map(CityMunicipal::find()->all(), 'name', 'name'),
                            [
                                'prompt' => 'Select City / Municipal',
                                'onchange' => '
                                    $.post(index.php?r=barangay/lists&id='.'"+$(this).val(), function(data){
                                        $("select#models-contact").html(data);
                                    });'
                            ]);?>
                    </div>

                    <div class="col-md-3">
                        <?= $form->field($model, 'barangay')->dropDownList(
                            ArrayHelper::map(Barangay::find()->all(), 'name', 'name'),
                            [
                                'prompt' => 'Select Barangay',

                            ]);?>